# 9. Select Data (choose)
select the ones that I want to retrive

In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Sib. #')
df

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

In [3]:
df['height'] >= 170 # height greater than equal to 170

Sib. #
1st    False
2nd     True
3rd     True
4th    False
Name: height, dtype: bool

In [4]:
filter_1 = (df['height'] >= 170) # bring the ones that are >= 170 
df[filter_1]

          name school  height  English  Math  Science SWskills
Sib. #
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java

In [5]:
df[~filter_1 # bring the ones that are < 170

         name school  height  English  Math  Science SWskills
Sib. #
1st     Sally  Biola     157       97    89       88      C++
4th     Peter  Emery     130      100    97       97    Swift

In [6]:
df[df['height'] >= 170] # bring the ones that are >= 170

          name school  height  English  Math  Science SWskills
Sib. #
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java

In [7]:
df.loc[df['height'] >= 170, 'Math'] # bring the math score of ones that are >= 170

Sib. #
2nd    100
3rd     78
Name: Math, dtype: int64

## mutiple selection

### AND(&), OR(|)

In [8]:
df.loc[(df['height'] >= 170) & (df['school'] == 'UCI')]

         name school  height  English  Math  Science SWskills
Sib. #
2nd     David    UCI     173       78   100       98   Python

### str method - startswith(), contains() ---- contains(, na = True)to set NaN to true

In [18]:
filter_1 = df['name'].str.startswith('D')
df[filter_1]

          name school  height  English  Math  Science SWskills
Sib. #
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java

In [21]:
langs = ['Python', 'Java']
filter_1 = df['SWskills'].isin(langs) # bring people with SWskills python or java
df[filter_1]

          name school  height  English  Math  Science SWskills
Sib. #
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java

In [22]:
langs = ['python', 'java'] # lower case str.lower()
filter_1 = df['SWskills'].str.lower().isin(langs) # bring people with SWskills python or java
df[filter_1]

          name school  height  English  Math  Science SWskills
Sib. #
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java